Tekla.Structures.Drawing.Cloud
The Cloud class defines a cloud that is a polygon with a specific size set for the bulges.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
if(MyDrawingHandler.GetConnectionStatus())
{
Cloud MyCloud;
PointList PolygonPoints = new PointList();
PolygonPoints.Add(new Point(10,10));
PolygonPoints.Add(new Point(50,10));
PolygonPoints.Add(new Point(50,50));
PolygonPoints.Add(new Point(10,50));
DrawingObjectEnumerator views = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews();
while(views.MoveNext())
{
MyCloud = new Cloud(views.Current as ViewBase, PolygonPoints);
MyCloud.Insert();
}
}
}
}

Tekla.Structures.Drawing.Cloud.Points
The list of points for the cloud.
The points you insert will specify the corner points of the cloud.
After you insert the object, you will get every cloud point back.

Tekla.Structures.Drawing.Cloud.Attributes
The attributes for the cloud.

Tekla.Structures.Drawing.Cloud.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Cloud.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList,Tekla.Structures.Drawing.Cloud.CloudAttributes)
Creates a new cloud instance with a point list using the given attributes.
view: The view to be used.
pointList: The point list to be used.
attributes: The cloud attributes to be used.

Tekla.Structures.Drawing.Cloud.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Drawing.PointList)
Creates a new cloud instance with a point list using standard attributes.
view: The view to be used.
pointList: The point list to be used.

Tekla.Structures.Drawing.Cloud.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Cloud.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Cloud.Insert
Calls the system to insert the new object.
Returns: True on success.

Tekla.Structures.Drawing.Cloud.Select
Calls the system to select and retrieve the object.
Returns: True on success.